app/controllers/plots_controller.rb

SELECT * FROM `plots`
---
  def index

     @plot = Plot.all

INSERT INTO `plots` (`updated_at`, `explVariable`, `created_at`, `respVariable`, `expName`, `calibFile`) VALUES('2013-07-09 16:04:56', 1, '2013-07-09 16:04:56', 1, 'test 7', '--- !ruby/object:File {}\n\n')
---
   def create

      @plot = Plot.new(params[:plot])
      @title = "Calibration Data Upload"
      logger.debug "here is the log: " + @plot.to_s

      @savedfile = false

      uploaded_io = params[:plot][:calibFile]
      logger.debug "here is the log: " + uploaded_io.to_s

      name = Time.now.strftime("%Y%m%d%H%M%S_") + sanitize_filename(uploaded_io.original_filename)
      logger.debug "here is the log: " + name.to_s

      #name =  Time.now.strftime("%Y%m%d%H%M%S ") + sanitize_filename(uploaded_io.original_filename)

      directory = "public/calibration_data/"
      Dir.mkdir(directory) unless File.directory?(directory)
      path = File.join(directory, name)
      File.open(path, "wb") { |file| file.write(uploaded_io.read) }
      @savedfile = true
      @plot.save

SELECT * FROM `plots` WHERE (`plots`.`id` = 5)
---
  def show

    @plot = Plot.find(params[:id])